Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/atdf/ATSAML22J16A.atdf
        <module name="TRNG" id="U2242" version="1.0.1">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x42004400"/>
            <parameters>
              <param name="INSTANCE_ID" value="81"/>
            </parameters>
          </instance>
        </module>
        <module name="USB" id="U2222" version="1.1.1">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x41000000"/>
            <signals>
              <signal group="DM" function="G" pad="PA24"/>
              <signal group="DP" function="G" pad="PA25"/>
              <signal group="SOF_1KHZ" function="G" pad="PA23"/>
              <signal group="SOF_1KHZ" function="G" pad="PB22"/>
            </signals>
            <parameters>
              <param name="EPT_NBR" value="8" caption="Number of USB end points (obsolete)"/>
              <param name="EPT_NUM" value="8" caption="Number of USB end points"/>
              <param name="GCLK_ID" value="6" caption="Index of Generic Clock"/>
              <param name="PIPE_NUM" value="0" caption="Number of USB pipes"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" version="1.0.1">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
        </module>
        <module name="MPU" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
          </instance>
        </module>
        <module name="NVIC" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="26" caption="Number of interrupt requests"/>
              <param name="__NVIC_PRIO_BITS" value="2" caption="Number of NVIC interrupt priority bits"/>
            </parameters>
          </instance>
        </module>
        <module name="SysTick" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
        </module>
        <module name="SystemControl" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
            <parameters>
              <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction" header:alternate-caption="SuperVisor Call"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service" header:alternate-caption="Pendable SerVice"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="SYSTEM" index="0" module-instance="MCLK OSCCTRL OSC32KCTRL PAC PM SUPC" caption="System peripherals shared interrupt"/>
        <interrupt name="WDT" index="1" module-instance="WDT" caption="Watchdog Timer"/>
        <interrupt name="RTC" index="2" module-instance="RTC" caption="Real Time Counter"/>
        <interrupt name="EIC" index="3" module-instance="EIC" caption="External Interrupt Controller"/>
        <interrupt name="FREQM" index="4" module-instance="FREQM" caption="Frequency Meter"/>
        <interrupt name="USB" index="5" module-instance="USB" caption="Universal Serial Bus"/>
        <interrupt name="NVMCTRL" index="6" module-instance="NVMCTRL" caption="Non-Volatile Memory Controller"/>
        <interrupt name="DMAC" index="7" module-instance="DMAC" caption="Direct Memory Controller"/>
        <interrupt name="EVSYS" index="8" module-instance="EVSYS" caption="Event Systems"/>
        <interrupt name="SERCOM0" index="9" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM1" index="10" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM2" index="11" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM3" index="12" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="TCC0" index="15" module-instance="TCC0" caption="Timer/Counter for Control Applications 0"/>
        <interrupt name="TC0" index="16" module-instance="TC0" caption="Timer/Counter 0"/>
        <interrupt name="TC1" index="17" module-instance="TC1" caption="Timer/Counter 1"/>
        <interrupt name="TC2" index="18" module-instance="TC2" caption="Timer/Counter 2"/>
        <interrupt name="TC3" index="19" module-instance="TC3" caption="Timer/Counter 3"/>
        <interrupt name="ADC" index="20" module-instance="ADC" caption="Analog-to-Digital Converter"/>
        <interrupt name="AC" index="21" module-instance="AC" caption="Analog Comparators"/>
        <interrupt name="PTC" index="22" module-instance="PTC" caption="Peripheral Touch Controller"/>
        <interrupt name="SLCD" index="23" module-instance="SLCD" caption="Segment Liquid Crytal Display Controller"/>
        <interrupt name="AES" index="24" module-instance="AES" caption="Advanced Encryption Standard"/>
        <interrupt name="TRNG" index="25" module-instance="TRNG" caption="True Random Number Generator"/>
      </interrupts>
      <events>
        <generators>
          <generator name="OSCCTRL_XOSC_FAIL" index="1" module-instance="OSCCTRL"/>
          <generator name="OSC32KCTRL_XOSC32K_FAIL" index="2" module-instance="OSC32KCTRL"/>
          <generator name="RTC_CMP_0" index="3" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="4" module-instance="RTC"/>
          <generator name="RTC_TAMPER" index="5" module-instance="RTC"/>
          <generator name="RTC_OVF" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_0" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="8" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="9" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="10" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="11" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="12" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="13" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="14" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="15" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="16" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="17" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="18" module-instance="EIC"/>
          <generator name="EIC_EXTINT_4" index="19" module-instance="EIC"/>
          <generator name="EIC_EXTINT_5" index="20" module-instance="EIC"/>
          <generator name="EIC_EXTINT_6" index="21" module-instance="EIC"/>
          <generator name="EIC_EXTINT_7" index="22" module-instance="EIC"/>
          <generator name="EIC_EXTINT_8" index="23" module-instance="EIC"/>
          <generator name="EIC_EXTINT_9" index="24" module-instance="EIC"/>
          <generator name="EIC_EXTINT_10" index="25" module-instance="EIC"/>
          <generator name="EIC_EXTINT_11" index="26" module-instance="EIC"/>
          <generator name="EIC_EXTINT_12" index="27" module-instance="EIC"/>
          <generator name="EIC_EXTINT_13" index="28" module-instance="EIC"/>
          <generator name="EIC_EXTINT_14" index="29" module-instance="EIC"/>
          <generator name="EIC_EXTINT_15" index="30" module-instance="EIC"/>
          <generator name="DMAC_CH_0" index="31" module-instance="DMAC"/>
          <generator name="DMAC_CH_1" index="32" module-instance="DMAC"/>
          <generator name="DMAC_CH_2" index="33" module-instance="DMAC"/>
          <generator name="DMAC_CH_3" index="34" module-instance="DMAC"/>
          <generator name="TCC0_OVF" index="35" module-instance="TCC0"/>
          <generator name="TCC0_TRG" index="36" module-instance="TCC0"/>
          <generator name="TCC0_CNT" index="37" module-instance="TCC0"/>
          <generator name="TCC0_MC_0" index="38" module-instance="TCC0"/>
          <generator name="TCC0_MC_1" index="39" module-instance="TCC0"/>
          <generator name="TCC0_MC_2" index="40" module-instance="TCC0"/>
          <generator name="TCC0_MC_3" index="41" module-instance="TCC0"/>
          <generator name="TC0_OVF" index="42" module-instance="TC0"/>
          <generator name="TC0_MC_0" index="43" module-instance="TC0"/>
          <generator name="TC0_MC_1" index="44" module-instance="TC0"/>
          <generator name="TC1_OVF" index="45" module-instance="TC1"/>
          <generator name="TC1_MC_0" index="46" module-instance="TC1"/>
          <generator name="TC1_MC_1" index="47" module-instance="TC1"/>
          <generator name="TC2_OVF" index="48" module-instance="TC2"/>
          <generator name="TC2_MC_0" index="49" module-instance="TC2"/>
          <generator name="TC2_MC_1" index="50" module-instance="TC2"/>
          <generator name="TC3_OVF" index="51" module-instance="TC3"/>
          <generator name="TC3_MC_0" index="52" module-instance="TC3"/>
          <generator name="TC3_MC_1" index="53" module-instance="TC3"/>
          <generator name="ADC_RESRDY" index="54" module-instance="ADC"/>
          <generator name="ADC_WINMON" index="55" module-instance="ADC"/>
          <generator name="AC_COMP_0" index="56" module-instance="AC"/>
          <generator name="AC_COMP_1" index="57" module-instance="AC"/>
          <generator name="AC_WIN_0" index="58" module-instance="AC"/>
          <generator name="SLCD_FC0OVERFLOW" index="61" module-instance="SLCD"/>
          <generator name="SLCD_FC1OVERFLOW" index="62" module-instance="SLCD"/>
          <generator name="SLCD_FC2OVERFLOW" index="63" module-instance="SLCD"/>
          <generator name="SLCD_DT" index="64" module-instance="SLCD"/>
          <generator name="TRNG_READY" index="65" module-instance="TRNG"/>
          <generator name="CCL_LUTOUT_0" index="66" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_1" index="67" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_2" index="68" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_3" index="69" module-instance="CCL"/>
          <generator name="PAC_ACCERR" index="70" module-instance="PAC"/>
        </generators>
        <users>
          <user name="RTC_TAMPER" index="0" module-instance="RTC"/>
          <user name="PORT_EV_0" index="1" module-instance="PORT"/>
          <user name="PORT_EV_1" index="2" module-instance="PORT"/>
          <user name="PORT_EV_2" index="3" module-instance="PORT"/>
          <user name="PORT_EV_3" index="4" module-instance="PORT"/>
          <user name="DMAC_CH_0" index="5" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="6" module-instance="DMAC"/>
          <user name="DMAC_CH_2" index="7" module-instance="DMAC"/>
          <user name="DMAC_CH_3" index="8" module-instance="DMAC"/>
          <user name="TCC0_EV_0" index="9" module-instance="TCC0"/>
          <user name="TCC0_EV_1" index="10" module-instance="TCC0"/>
          <user name="TCC0_MC_0" index="11" module-instance="TCC0"/>
          <user name="TCC0_MC_1" index="12" module-instance="TCC0"/>
          <user name="TCC0_MC_2" index="13" module-instance="TCC0"/>
          <user name="TCC0_MC_3" index="14" module-instance="TCC0"/>
          <user name="TC0_EVU" index="15" module-instance="TC0"/>
          <user name="TC1_EVU" index="16" module-instance="TC1"/>
          <user name="TC2_EVU" index="17" module-instance="TC2"/>
          <user name="TC3_EVU" index="18" module-instance="TC3"/>
          <user name="ADC_START" index="19" module-instance="ADC"/>
          <user name="ADC_SYNC" index="20" module-instance="ADC"/>
          <user name="AC_SOC_0" index="21" module-instance="AC"/>
          <user name="AC_SOC_1" index="22" module-instance="AC"/>
          <user name="CCL_LUTIN_0" index="24" module-instance="CCL"/>
          <user name="CCL_LUTIN_1" index="25" module-instance="CCL"/>
          <user name="CCL_LUTIN_2" index="26" module-instance="CCL"/>
          <user name="CCL_LUTIN_3" index="27" module-instance="CCL"/>
          <user name="MTB_START" index="29" module-instance="MTB"/>
          <user name="MTB_STOP" index="30" module-instance="MTB"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x10820107"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2245" version="1.0.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
