Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/atdf/ATSAML22J16A.atdf
      <value-group name="SERCOM_USART_CTRLA__DORD">
        <value name="MSB" caption="MSB is transmitted first" value="0x0"/>
        <value name="LSB" caption="LSB is transmitted first" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__FORM">
        <value name="USART_FRAME_NO_PARITY" caption="USART frame" value="0x0"/>
        <value name="USART_FRAME_WITH_PARITY" caption="USART frame with parity" value="0x1"/>
        <value name="USART_FRAME_AUTO_BAUD_NO_PARITY" caption="Auto-baud - break detection and auto-baud" value="0x4"/>
        <value name="USART_FRAME_AUTO_BAUD_WITH_PARITY" caption="Auto-baud - break detection and auto-baud with parity" value="0x5"/>
        <value name="USART_FRAME_ISO_7816" caption="ISO 7816" value="0x7"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__RXPO">
        <value name="PAD0" caption="SERCOM PAD[0] is used for data reception" value="0x0"/>
        <value name="PAD1" caption="SERCOM PAD[1] is used for data reception" value="0x1"/>
        <value name="PAD2" caption="SERCOM PAD[2] is used for data reception" value="0x2"/>
        <value name="PAD3" caption="SERCOM PAD[3] is used for data reception" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__TXPO">
        <value name="PAD0" caption="PAD[0] = TxD; PAD[1] = XCK" value="0x0"/>
        <value name="PAD1" caption="PAD[2] = TxD; PAD[3] = XCK" value="0x1"/>
        <value name="PAD2" caption="PAD[0] = TxD; PAD[2] = RTS; PAD[3] = CTS" value="0x2"/>
        <value name="PAD3" caption="PAD[0] = TxD; PAD[1] = XCK; PAD[2] = TE" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__SAMPR">
        <value name="16X_ARITHMETIC" caption="16x over-sampling using arithmetic baudrate generation" value="0x0"/>
        <value name="16X_FRACTIONAL" caption="16x over-sampling using fractional baudrate generation" value="0x1"/>
        <value name="8X_ARITHMETIC" caption="8x over-sampling using arithmetic baudrate generation" value="0x2"/>
        <value name="8X_FRACTIONAL" caption="8x over-sampling using fractional baudrate generation" value="0x3"/>
        <value name="3X_ARITHMETIC" caption="3x over-sampling using arithmetic baudrate generation" value="0x4"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__SAMPA">
        <value name="ADJ0" caption="16x Over-sampling = 7-8-9; 8x Over-sampling = 3-4-5" value="0x0"/>
        <value name="ADJ1" caption="16x Over-sampling = 9-10-11; 8x Over-sampling = 4-5-6" value="0x1"/>
        <value name="ADJ2" caption="16x Over-sampling = 11-12-13; 8x Over-sampling = 5-6-7" value="0x2"/>
        <value name="ADJ3" caption="16x Over-sampling = 13-14-15; 8x Over-sampling = 6-7-8" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__CHSIZE">
        <value name="8_BIT" caption="8 Bits" value="0x0"/>
        <value name="9_BIT" caption="9 Bits" value="0x1"/>
        <value name="5_BIT" caption="5 Bits" value="0x5"/>
        <value name="6_BIT" caption="6 Bits" value="0x6"/>
        <value name="7_BIT" caption="7 Bits" value="0x7"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__PMODE">
        <value name="EVEN" caption="Even Parity" value="0x0"/>
        <value name="ODD" caption="Odd Parity" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__SBMODE">
        <value name="1_BIT" caption="One Stop Bit" value="0x0"/>
        <value name="2_BIT" caption="Two Stop Bits" value="0x1"/>
      </value-group>
    </module>
    <module name="SLCD" id="U2264" version="1.0.0" caption="Segment Liquid Crystal Display Controller">
      <register-group name="SLCD" caption="Segment Liquid Crystal Display Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x03D80000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="DUTY" caption="Duty Ratio" mask="0x1C" values="SLCD_CTRLA__DUTY"/>
          <bitfield name="WMOD" caption="Waveform Mode" mask="0x20" values="SLCD_CTRLA__WMOD"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="PRESC" caption="Clock Prescaler" mask="0x300" values="SLCD_CTRLA__PRESC"/>
          <bitfield name="CKDIV" caption="Clock Divider" mask="0x7000"/>
          <bitfield name="BIAS" caption="Bias Setting" mask="0x30000" values="SLCD_CTRLA__BIAS"/>
          <bitfield name="XVLCD" caption="External VLCD" mask="0x80000"/>
          <bitfield name="PRF" caption="Power Refresh Frequency" mask="0x300000" values="SLCD_CTRLA__PRF"/>
          <bitfield name="DMFCS" caption="Display Memory Update Frame Counter Selection" mask="0xC00000" values="SLCD_CTRLA__DMFCS"/>
          <bitfield name="RRF" caption="Reference Refresh Frequency" mask="0x7000000" values="SLCD_CTRLA__RRF"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="2" initval="0x0000" caption="Control B">
          <bitfield name="BBD" caption="Bias Buffer Enable Duration" mask="0xF"/>
          <bitfield name="BBEN" caption="Bias Buffer Enable" mask="0x80"/>
          <bitfield name="LRD" caption="Low Resistance Enable Duration" mask="0xF00"/>
          <bitfield name="LREN" caption="Low Resistance Enable" mask="0x8000"/>
        </register>
        <register name="CTRLC" offset="0x6" rw="RW" size="2" initval="0x0000" caption="Control C">
          <bitfield name="CLEAR" caption="Clear Display Memory" mask="0x1"/>
          <bitfield name="LOCK" caption="Lock Shadow Memory" mask="0x2"/>
          <bitfield name="ABMEN" caption="Automated Bit Mapping Enable" mask="0x4"/>
          <bitfield name="ACMEN" caption="Automated Character Mapping Enable" mask="0x8"/>
          <bitfield name="CTST" caption="Contrast Adjustment" mask="0xF0"/>
          <bitfield name="LPPM" caption="LCD Power Macro Power mode" mask="0x300" values="SLCD_CTRLC__LPPM"/>
        </register>
